app/views/posts/show.html.erb

	<div class = "container">
		<h2 class = "subtile is-5"><strong><%= @post.comments.count%></strong> Comments</h2>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 3]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 3]]