app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("name", "comment", "created_at", "updated_at", "post_id") VALUES (?, ?, ?, ?, ?)  [["name", "rewq"], ["comment", "rqewrewq"], ["created_at", "2020-10-02 14:13:56.464007"], ["updated_at", "2020-10-02 14:13:56.464007"], ["post_id", 4]]
---
	def create
		@post = Post.find(params[:post_id])
		@comment = @post.comments.create(params[:comment].permit(:name, :comment))